app/controllers/comments_controller.rb

	def create
		c = Comment.new(comment_params)
		c.save
---
INSERT INTO "comments" ("username", "email", "content", "issue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "123"], ["email", "123"], ["content", "123123"], ["issue_id", 9], ["created_at", "2016-02-29 09:56:22.498858"], ["updated_at", "2016-02-29 09:56:22.498858"]]