app/controllers/issues_controller.rb

  def show
  	@issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
  	i = Issue.find(params[:id])
  	i.destroy
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 4]]

  def create
  	Issue.create(issue_params)
---
INSERT INTO "issues" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "123"], ["content", "1234567"], ["created_at", "2016-02-23 06:45:43.663788"], ["updated_at", "2016-02-23 06:45:43.663788"]]

  def edit
   @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 3]]

  def update
  	i = Issue.find(params[:id])
  	i.update_attributes(issue_params)
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "issues" SET "title" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["title", "1234"], ["updated_at", "2016-02-23 06:57:46.410812"], ["id", 3]]