app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "wxl"]]
---
	def create_login_session
		user = User.find_by_name(params[:name])